DELIMITER $$
CREATE PROCEDURE insert_product_dummy_data()
BEGIN
  START TRANSACTION;
  INSERT INTO products_table (product_name, price, description)
  VALUES ('상품1', 10000, '상품 설명1'),
         ('상품2', 20000, '상품 설명2'),
         ('상품3', 10000, '상품 설명3'),
         ('상품4', 20000, '상품 설명4'),
         ('상품5', 10000, '상품 설명5'),
         ('상품6', 20000, '상품 설명6'),
         ('상품7', 10000, '상품 설명7'),
         ('상품8', 20000, '상품 설명8'),
         ('상품9', 10000, '상품 설명9'),
         ('상품10', 20000, '상품 설명10'),
         ('상품11', 10000, '상품 설명11'),
         ('상품12', 20000, '상품 설명12'),
         ('상품13', 10000, '상품 설명13'),
         ('상품14', 20000, '상품 설명14'),
         ('상품15', 10000, '상품 설명15'),
         ('상품16', 20000, '상품 설명16'),
         ('상품17', 10000, '상품 설명17'),
         ('상품18', 20000, '상품 설명18'),
         ('상품19', 10000, '상품 설명19'),
         ('상품20', 20000, '상품 설명20');
  COMMIT;
END $$
DELIMITER ;

CALL insert_user_and_product_dummy_data();
